app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "year_released", "director", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Midsommar"], ["year_released", 2019], ["director", "Ari Aster"], ["created_at", "2020-04-08 20:35:47.680305"], ["updated_at", "2020-04-08 20:35:47.680305"]]
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save