app/controllers/posts_controller.rb

  def create
    @movie_id = Movie.find(params[:movie_id])
    puts @movie_id
    @post = Post.new(post_params)
    if @post.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", " good"], ["user_id", 20], ["movie_id", 9], ["created_at", "2020-04-14 03:04:36.918184"], ["updated_at", "2020-04-14 03:04:36.918184"]]